sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
/*
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*********************
 *      INCLUDES
 *********************/
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <inttypes.h>
#include <string.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "soc/soc_caps.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_cache.h"
#include "esp_private/esp_cache_private.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "display_bridge.h"
#include "display_manager.h"
#include "lvgl_port_ppa.h"
#include "display_te_sync.h"
#if LVGL_VERSION_MAJOR >= 9
#include "lvgl_private.h"
#endif
#include "lvgl_port_alignment.h"
#include "common/display_bridge_common.h"

#if SOC_MIPI_DSI_SUPPORTED
#include "esp_lcd_mipi_dsi.h"
#endif

#if SOC_LCDCAM_RGB_LCD_SUPPORTED
#include "esp_lcd_panel_rgb.h"
#endif

#define ESP_LV_ADAPTER_DUMMY_DRAW_EVT_COLOR_DONE  (1U << 0)
#define ESP_LV_ADAPTER_DUMMY_DRAW_EVT_FRAME_DONE  (1U << 1)

#if CONFIG_SOC_PPA_SUPPORTED
#include "driver/ppa.h"
#endif

#if SOC_DMA2D_SUPPORTED
#ifdef ESP_ASYNC_COLOR_CONVERT_AVAILABLE
#include "esp_async_color_convert.h"
#else
#include "esp_async_fbcpy.h"
#endif
#endif

/*********************
 *      DEFINES
 *********************/
/* Color depth constants */
#define COLOR_DEPTH_RGB565         (16)    /* 16-bit RGB565 color format */
#define COLOR_DEPTH_RGB888         (24)    /* 24-bit RGB888 color format */
#define COLOR_BYTES_RGB565         (2)     /* Bytes per pixel for RGB565 */
#define COLOR_BYTES_RGB888         (3)     /* Bytes per pixel for RGB888 */

#if SOC_DMA2D_SUPPORTED
#ifdef ESP_ASYNC_COLOR_CONVERT_AVAILABLE
#define DMA2D_PIXEL_FORMAT_FIELD(_color_bytes) \
    .src_color_format = ((_color_bytes) == COLOR_BYTES_RGB565 ? ESP_COLOR_FOURCC_RGB16 : ESP_COLOR_FOURCC_RGB24), \
    .dst_color_format = ((_color_bytes) == COLOR_BYTES_RGB565 ? ESP_COLOR_FOURCC_RGB16 : ESP_COLOR_FOURCC_RGB24)
#elif defined(ESP_COLOR_FOURCC_RGB16) && defined(ESP_COLOR_FOURCC_RGB24)
#define DMA2D_PIXEL_FORMAT_FIELD(_color_bytes) \
    .pixel_format_fourcc_id = ((_color_bytes) == COLOR_BYTES_RGB565 ? ESP_COLOR_FOURCC_RGB16 : ESP_COLOR_FOURCC_RGB24)
#else
#define DMA2D_PIXEL_FORMAT_FIELD(_color_bytes) \
    .pixel_format_unique_id = { \
        .color_type_id = ((_color_bytes) == COLOR_BYTES_RGB565) ? \
        COLOR_TYPE_ID(COLOR_SPACE_RGB, COLOR_PIXEL_RGB565) : \
        COLOR_TYPE_ID(COLOR_SPACE_RGB, COLOR_PIXEL_RGB888) \
    }
#endif
#endif

/* PPA transformation constants */
#define PPA_SCALE_FACTOR_NO_SCALE  (1.0f)  /* No scaling (1:1) */
#define PPA_SWAP_DISABLED          (0)     /* RGB/byte swap disabled */

/* Hardware alignment */
#define PPA_DEFAULT_ALIGNMENT      (128)   /* Default PPA alignment in bytes */

#define DISPLAY_BRIDGE_V9_DIFF_BUFFER_COUNT  (3U)
#define DISPLAY_BRIDGE_V9_DIFF_RECT_CAPACITY (LV_INV_BUF_SIZE)
#define DISPLAY_BRIDGE_V9_REPAIR_CAPACITY    (LV_INV_BUF_SIZE * 4U + 4U)

/*********************
 *      TYPEDEFS
 *********************/
#if LVGL_VERSION_MAJOR < 9

/* Empty implementation for LVGL v8 */

#else

typedef struct {
    uint32_t revision;
    uint16_t pending_count;
    bool valid;
    /* Regions where this framebuffer is behind the latest submitted frame. */
    lv_area_t pending[DISPLAY_BRIDGE_V9_DIFF_RECT_CAPACITY];
} display_bridge_v9_diff_buffer_t;

typedef struct {
    display_bridge_v9_diff_buffer_t buffers[DISPLAY_BRIDGE_V9_DIFF_BUFFER_COUNT];
    uint32_t revision;
} display_bridge_v9_diff_tracker_t;

typedef struct esp_lv_adapter_display_bridge_v9 {
    esp_lv_adapter_display_bridge_t base;
    esp_lv_adapter_display_runtime_config_t cfg;
    esp_lcd_panel_handle_t panel;
    esp_lv_adapter_display_runtime_info_t runtime;
    esp_lv_adapter_display_dirty_region_t dirty;
    portMUX_TYPE double_sync_lock;
    void *disp_fb;                                /**< Currently displayed buffer (front buffer) */
    void *pending_fb;                             /**< Submitted full-refresh buffer waiting for DMA switch */
    void *draw_fb;                                /**< Currently drawing buffer (back buffer) */
    uint32_t switch_seq;
    uint32_t double_wait_switch_seq;
    bool double_wait_active;
    bool frame_buf_submit_pending;
    SemaphoreHandle_t double_wait_sem;
    TaskHandle_t notify_task;
    TaskHandle_t dummy_draw_wait_task;
    uint32_t dummy_draw_wait_mask;
    bool dummy_draw;
    int block_size_small;
    int block_size_large;
    size_t cache_line_size;
    esp_lv_adapter_vsync_timing_t vsync_timing;   /*!< Standardized VSYNC timing context */
    bool idf_callbacks_registered;
    bool idf_callback_registration_enabled;

    /* --- Pipeline buffer management (owned by bridge, inited by display_bridge_pipeline_init_from_cfg) --- */
    esp_lv_adapter_display_pipeline_t pipeline;
    display_bridge_v9_diff_tracker_t diff_tracker;
} esp_lv_adapter_display_bridge_v9_t;

#if CONFIG_SOC_PPA_SUPPORTED || CONFIG_SOC_DMA2D_SUPPORTED
typedef struct display_bridge_v9_hw_resource {
    size_t data_cache_line_size;
#if CONFIG_SOC_PPA_SUPPORTED
    ppa_client_handle_t ppa_handle;
#endif
    /* DMA2D resources live in the shared singleton (display_bridge_get_hw_resource) */
} display_bridge_v9_hw_resource_t;
#endif

#endif /* LVGL_VERSION_MAJOR < 9 */

/**********************
 *  STATIC VARIABLES
 **********************/
static const char *TAG = "esp_lvgl:bridge_v9";

#if LVGL_VERSION_MAJOR >= 9
#if CONFIG_SOC_PPA_SUPPORTED || CONFIG_SOC_DMA2D_SUPPORTED
static display_bridge_v9_hw_resource_t hw_resource = {0};
#endif
#endif

/**********************
 *  INLINE FUNCTIONS
 **********************/
#if LVGL_VERSION_MAJOR >= 9

static inline uint16_t bridge_h_res(const esp_lv_adapter_display_bridge_v9_t *impl)
{
    return impl->runtime.hor_res;
}

static inline uint16_t bridge_v_res(const esp_lv_adapter_display_bridge_v9_t *impl)
{
    return impl->runtime.ver_res;
}

