sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
static bool display_bridge_v9_diff_subtract(
    const lv_area_t *pending,
    uint16_t pending_count,
    const lv_area_t *current,
    uint16_t current_count,
    lv_area_t *repair,
    uint16_t *repair_count)
{
    if (pending_count > DISPLAY_BRIDGE_V9_REPAIR_CAPACITY) {
        return false;
    }
    if (pending_count != 0) {
        memcpy(repair, pending, pending_count * sizeof(*repair));
    }
    *repair_count = pending_count;
    for (uint16_t cut = 0; cut < current_count; ++cut) {
        uint16_t index = 0;
        while (index < *repair_count) {
            lv_area_t source = repair[index];
            lv_area_t overlap = {
                .x1 = LV_MAX(source.x1, current[cut].x1),
                .y1 = LV_MAX(source.y1, current[cut].y1),
                .x2 = LV_MIN(source.x2, current[cut].x2),
                .y2 = LV_MIN(source.y2, current[cut].y2),
            };
            if (!display_bridge_v9_diff_rect_valid(&overlap)) {
                ++index;
                continue;
            }

            repair[index] = repair[--(*repair_count)];
            if (!display_bridge_v9_diff_subtract_one(
                        source, current[cut], repair, repair_count,
                        DISPLAY_BRIDGE_V9_REPAIR_CAPACITY)) {
                *repair_count = 0;
                return false;
            }
        }
    }
    display_bridge_v9_diff_coalesce_exact(repair, repair_count);
    return true;
}

static void display_bridge_v9_diff_commit(
    esp_lv_adapter_display_bridge_v9_t *impl,
    uint8_t target_index,
    const lv_area_t *current,
    uint16_t current_count)
{
    if (impl->diff_tracker.revision == UINT32_MAX) {
        memset(&impl->diff_tracker, 0, sizeof(impl->diff_tracker));
    }
    uint32_t revision = ++impl->diff_tracker.revision;
    uint8_t count = LV_MIN(impl->runtime.frame_buffer_count,
                           (uint8_t)DISPLAY_BRIDGE_V9_DIFF_BUFFER_COUNT);
    for (uint8_t index = 0; index < count; ++index) {
        display_bridge_v9_diff_buffer_t *state =
            &impl->diff_tracker.buffers[index];
        if (index == target_index || !state->valid) {
            continue;
        }
        uint16_t pending_count = state->pending_count;
        for (uint16_t rect = 0; rect < current_count; ++rect) {
            if (!display_bridge_v9_diff_merge_one(
                        state->pending, &pending_count,
                        DISPLAY_BRIDGE_V9_DIFF_RECT_CAPACITY, current[rect])) {
                state->valid = false;
                state->pending_count = 0;
                break;
            }
        }
        if (state->valid) {
            state->pending_count = pending_count;
        }
    }
    impl->diff_tracker.buffers[target_index] =
    (display_bridge_v9_diff_buffer_t) {
        .revision = revision,
        .valid = true,
    };
}

#if CONFIG_SOC_PPA_SUPPORTED
static inline ppa_srm_color_mode_t display_bridge_v9_ppa_color_mode(uint8_t color_bytes)
{
    return (color_bytes == COLOR_BYTES_RGB888) ? PPA_SRM_COLOR_MODE_RGB888 : PPA_SRM_COLOR_MODE_RGB565;
}
#endif

static inline void display_bridge_v9_get_rotation_geometry(const esp_lv_adapter_display_bridge_v9_t *impl,
                                                           uint16_t *src_logical_w,
                                                           uint16_t *src_logical_h,
                                                           uint16_t *dst_physical_w,
                                                           uint16_t *dst_physical_h)
{
    const uint16_t phys_w = bridge_h_res(impl);
    const uint16_t phys_h = bridge_v_res(impl);
    const bool swapped = (bridge_rotation(impl) == ESP_LV_ADAPTER_ROTATE_90 ||
                          bridge_rotation(impl) == ESP_LV_ADAPTER_ROTATE_270);

    if (src_logical_w) {
        *src_logical_w = swapped ? phys_h : phys_w;
    }
    if (src_logical_h) {
        *src_logical_h = swapped ? phys_w : phys_h;
    }
    if (dst_physical_w) {
        *dst_physical_w = phys_w;
    }
    if (dst_physical_h) {
        *dst_physical_h = phys_h;
    }
}

static inline bool bridge_mode_uses_double_switch_wait(esp_lv_adapter_tear_avoid_mode_t mode)
{
    return mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT ||
           mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL;
}

static inline bool bridge_mode_uses_rotated_nonpartial_pipeline_release(const esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl) {
        return false;
    }

    if (bridge_rotation(impl) == ESP_LV_ADAPTER_ROTATE_0) {
        return false;
    }

    switch (impl->cfg.base.tear_avoid_mode) {
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT:
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL:
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL:
        return true;
    default:
        return false;
    }
}

static inline bool bridge_mode_needs_double_prime(esp_lv_adapter_tear_avoid_mode_t mode)
{
    return mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT;
}

static inline bool bridge_mode_uses_buf_switch_release(esp_lv_adapter_tear_avoid_mode_t mode)
{
    return bridge_mode_uses_double_switch_wait(mode) ||
           mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL ||
           mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL ||
           mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL;
}

static inline bool bridge_mode_needs_submit_gated_frame_complete(const esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl) {
        return false;
    }

    const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;

    if (mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL ||
            mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL) {
        return false;
    }

    return impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_MIPI_DSI &&
           bridge_mode_uses_buf_switch_release(mode);
}

static inline void display_bridge_v9_mark_frame_buf_submit(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!bridge_mode_needs_submit_gated_frame_complete(impl)) {
        return;
    }

    portENTER_CRITICAL(&impl->double_sync_lock);
    impl->frame_buf_submit_pending = true;
    portEXIT_CRITICAL(&impl->double_sync_lock);
}

