sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
        ESP_ERROR_CHECK(esp_cache_get_alignment(MALLOC_CAP_SPIRAM, &hw_resource.data_cache_line_size));
        if (hw_resource.data_cache_line_size == 0) {
            hw_resource.data_cache_line_size = PPA_DEFAULT_ALIGNMENT;
        }

        hw_resource_initialized = true;
        ESP_LOGI(TAG, "Hardware resources initialized successfully");
    }
#endif

#if CONFIG_SOC_DMA2D_SUPPORTED
    ESP_RETURN_ON_FALSE(display_bridge_get_hw_resource() != NULL, NULL, TAG, "Acquire DMA2D resource failed");
#endif

#if CONFIG_SOC_PPA_SUPPORTED
    if (hw_resource.ppa_handle == NULL) {
        ppa_client_config_t ppa_srm_config = {
            .oper_type = PPA_OPERATION_SRM,
            .max_pending_trans_num = LVGL_PORT_PPA_MAX_PENDING_TRANS,
        };
        ESP_ERROR_CHECK(ppa_register_client(&ppa_srm_config, &hw_resource.ppa_handle));
    }
#endif

    impl->base.flush = display_bridge_v9_flush_entry;
    impl->base.destroy = display_bridge_v9_destroy;
    impl->base.set_dummy_draw = display_bridge_v9_set_dummy_draw;
    impl->base.set_dummy_draw_callbacks = display_bridge_v9_set_dummy_draw_callbacks;
    impl->base.dummy_draw_blit = display_bridge_v9_dummy_draw_blit;
    impl->base.dummy_draw_get_free_buf = display_bridge_v9_dummy_draw_get_free_buf;
    impl->base.dummy_draw_flush_buf = display_bridge_v9_dummy_draw_flush_buf;
    impl->base.update_panel = display_bridge_v9_update_panel;
    impl->base.set_area_rounder = display_bridge_v9_set_area_rounder;
    impl->base.set_draw_bitmap_callbacks = display_bridge_v9_set_draw_bitmap_callbacks;
    impl->base.notify_color_trans_done_from_isr = display_bridge_v9_notify_color_trans_done_from_isr;
    impl->base.notify_frame_done_from_isr = display_bridge_v9_notify_frame_done_from_isr;
    impl->base.notify_frame_buf_complete_from_isr = display_bridge_v9_notify_frame_buf_complete_from_isr;
    impl->cfg = *cfg;
    impl->panel = cfg->base.panel;
    impl->dummy_draw = cfg->dummy_draw_enabled;
    impl->double_sync_lock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
    impl->double_wait_sem = NULL;
    impl->frame_buf_submit_pending = false;
    if (display_bridge_v9_configure_double_wait_resource(impl) != ESP_OK) {
        free(impl);
        return NULL;
    }
    impl->notify_task = NULL;
    impl->dummy_draw_wait_task = NULL;
    impl->dummy_draw_wait_mask = 0;
    impl->idf_callback_registration_enabled = cfg->idf_callback_registration_enabled;
    impl->cache_line_size = display_bridge_get_cache_line_size();
    display_bridge_get_block_sizes(&impl->block_size_small, &impl->block_size_large);
    if (impl->block_size_small <= 0) {
        impl->block_size_small = ESP_LV_ADAPTER_BRIDGE_BLOCK_SIZE_SMALL_DEFAULT;
    }
    if (impl->block_size_large <= 0) {
        impl->block_size_large = impl->block_size_small * 8;
    }
    if (impl->block_size_large < impl->block_size_small) {
        impl->block_size_large = impl->block_size_small;
    }

    /* Use common function for runtime info initialization */
    if (display_bridge_init_runtime_info(&impl->runtime, cfg) != ESP_OK) {
        if (impl->double_wait_sem) {
            vSemaphoreDeleteWithCaps(impl->double_wait_sem);
        }
        free(impl);
        return NULL;
    }

    /* Configure VSYNC jitter shield: Specifically for MIPI DSI panels
       in double-buffered modes to prevent visual artifacts due to race conditions. */
    const bool is_mipi = (cfg->base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_MIPI_DSI);
    const bool is_double_flush = (cfg->base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL ||
                                  cfg->base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT ||
                                  cfg->base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL);
    if (is_mipi && is_double_flush) {
        display_bridge_vsync_config_jitter_shield(&impl->vsync_timing, 1000);
    }

    /* Create and init pipeline in bridge (disp_fb/draw_fb written via out params) */
    int pipeline_ret = display_bridge_pipeline_init_from_cfg(&impl->pipeline, &impl->cfg,
                                                             &impl->disp_fb, &impl->draw_fb);
    if (pipeline_ret == -1) {
        ESP_LOGE(TAG, "pipeline init failed");
        if (impl->double_wait_sem) {
            vSemaphoreDeleteWithCaps(impl->double_wait_sem);
        }
        free(impl);
        return NULL;
    }

    display_dirty_region_reset(&impl->dirty);
    display_bridge_v9_diff_reset(impl);
    display_bridge_v9_prime_double_buffers(impl);

    if (impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_OTHER &&
            impl->runtime.rotation != ESP_LV_ADAPTER_ROTATE_0 &&
            impl->cfg.base.profile.mono_layout == ESP_LV_ADAPTER_MONO_LAYOUT_NONE) {
        ESP_LOGW(TAG, "rotation=%d configured on panel interface OTHER; adapter will not apply"
                 " rotation. Configure the LCD panel orientation during panel initialization.",
                 impl->runtime.rotation);
    }

    if (impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_OTHER && !impl->cfg.base.panel_io) {
        ESP_LOGE(TAG, "panel_io handle required for interface OTHER");
        if (impl->pipeline.elems) {
            free(impl->pipeline.elems);
        }
        if (impl->double_wait_sem) {
            vSemaphoreDeleteWithCaps(impl->double_wait_sem);
        }
        free(impl);
        return NULL;
    }

    display_bridge_v9_register_vsync(impl);

    return &impl->base;
#endif
}

#if LVGL_VERSION_MAJOR >= 9

/**
 * @brief Destroy LVGL v9 display bridge
 *
 * Cleanup function for v9 bridge implementation. Delegates to common destroy
 * function as the cleanup logic is identical across v8 and v9.
 *
 * @param[in] bridge Pointer to the display bridge to destroy
 */
static void display_bridge_v9_destroy(esp_lv_adapter_display_bridge_t *bridge)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;

    /* Remove rounder event callback if exists */
    if (impl && impl->cfg.lv_disp) {
        lv_display_remove_event_cb_with_user_data(impl->cfg.lv_disp, rounder_event_cb, impl);
    }

