sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
    /* Clear VSync callbacks and free pipeline (owned by bridge) */
    if (impl) {
        display_bridge_v9_unregister_vsync(impl);
        if (impl->pipeline.elems) {
            free(impl->pipeline.elems);
            impl->pipeline.elems = NULL;
            impl->pipeline.elem_count = 0;
        }
        if (impl->double_wait_sem) {
            vSemaphoreDeleteWithCaps(impl->double_wait_sem);
            impl->double_wait_sem = NULL;
        }
    }

    /* Use unified destroy implementation for v8/v9 compatibility */
    display_bridge_common_destroy(bridge);
}

/**
 * @brief Update panel handle and configuration for rebind
 */
static esp_err_t display_bridge_v9_update_panel(esp_lv_adapter_display_bridge_t *bridge,
                                                const esp_lv_adapter_display_runtime_config_t *cfg)
{
    ESP_RETURN_ON_FALSE(bridge && cfg, ESP_ERR_INVALID_ARG, TAG, "Invalid arguments");

    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;

    /* Unregister old VSYNC callbacks before updating panel */
    display_bridge_v9_unregister_vsync(impl);

    /* Free old pipeline (owned by bridge) */
    if (impl->pipeline.elems) {
        free(impl->pipeline.elems);
        impl->pipeline.elems = NULL;
        impl->pipeline.elem_count = 0;
    }
    STAILQ_INIT(&impl->pipeline.busy_list);
    STAILQ_INIT(&impl->pipeline.empty_list);

    /* Update panel handle */
    impl->panel = cfg->base.panel;

    /* Update configuration */
    impl->cfg = *cfg;
    impl->double_sync_lock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
    impl->pending_fb = NULL;
    impl->switch_seq = 0;
    impl->double_wait_switch_seq = 0;
    impl->double_wait_active = false;
    impl->frame_buf_submit_pending = false;
    if (display_bridge_v9_configure_double_wait_resource(impl) != ESP_OK) {
        return ESP_ERR_NO_MEM;
    }

    ESP_RETURN_ON_ERROR(display_bridge_init_runtime_info(&impl->runtime, cfg), TAG,
                        "runtime info initialization failed");

    /* Configure VSYNC jitter shield: Specifically for MIPI DSI panels
       in double-buffered modes to prevent visual artifacts due to race conditions. */
    const bool is_mipi = (cfg->base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_MIPI_DSI);
    const bool is_double_flush = (cfg->base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL ||
                                  cfg->base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT ||
                                  cfg->base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL);
    if (is_mipi && is_double_flush) {
        display_bridge_vsync_config_jitter_shield(&impl->vsync_timing, 1000);
    } else {
        display_bridge_vsync_config_jitter_shield(&impl->vsync_timing, 0);
    }

    /* Re-init pipeline (same as create path, disp_fb/draw_fb via out params) */
    int pipeline_ret = display_bridge_pipeline_init_from_cfg(&impl->pipeline, &impl->cfg,
                                                             &impl->disp_fb, &impl->draw_fb);
    if (pipeline_ret == -1) {
        ESP_LOGE(TAG, "pipeline re-init failed (update_panel)");
        return ESP_ERR_NO_MEM;
    }

    /* Reset dirty region tracking */
    display_dirty_region_reset(&impl->dirty);
    display_bridge_v9_diff_reset(impl);
    display_bridge_v9_prime_double_buffers(impl);

    /* Re-register VSYNC callbacks for new panel */
    if (cfg->base.panel) {
        display_bridge_v9_register_vsync(impl);
    }

    return ESP_OK;
}

/**********************
 *   CORE CALLBACKS
 **********************/

/**
 * @brief Main flush entry point
 */
static void display_bridge_v9_flush_entry(esp_lv_adapter_display_bridge_t *bridge,
                                          void *disp_ref,
                                          const lv_area_t *area,
                                          uint8_t *color_map)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    lv_display_t *disp = (lv_display_t *)disp_ref;

    if (!impl || !area || !disp) {
        if (disp) {
            display_manager_flush_ready(disp);
        }
        return;
    }

    /* Safety check: panel detached for sleep management */
    if (!impl->panel) {
        ESP_LOGD(TAG, "Panel detached, skipping flush");
        display_manager_flush_ready(disp);
        return;
    }

    if (impl->dummy_draw) {
        display_manager_flush_ready(disp);
        return;
    }

    if (!display_bridge_v9_prepare_mono(impl, disp, area, &color_map)) {
        display_manager_flush_ready(disp);
        return;
    }

    const bool mono_rotated = (impl->cfg.base.profile.mono_layout != ESP_LV_ADAPTER_MONO_LAYOUT_NONE &&
                               impl->cfg.base.profile.rotation != ESP_LV_ADAPTER_ROTATE_0);
    lv_area_t phy_area;
    const lv_area_t *flush_area = area;

    if (mono_rotated) {
        uint16_t pw = impl->cfg.base.profile.hor_res;
        uint16_t ph = impl->cfg.base.profile.ver_res;
        int x1, y1, x2, y2;

        switch (impl->cfg.base.profile.rotation) {
        case ESP_LV_ADAPTER_ROTATE_90:
            x1 = pw - 1 - area->y2;
            x2 = pw - 1 - area->y1;
            y1 = area->x1;
            y2 = area->x2;
            break;
        case ESP_LV_ADAPTER_ROTATE_180:
            x1 = pw - 1 - area->x2;
            x2 = pw - 1 - area->x1;
            y1 = ph - 1 - area->y2;
            y2 = ph - 1 - area->y1;
            break;
        case ESP_LV_ADAPTER_ROTATE_270:
            x1 = area->y1;
            x2 = area->y2;
            y1 = ph - 1 - area->x2;
            y2 = ph - 1 - area->x1;
            break;
        default:
            x1 = y1 = x2 = y2 = 0;
            break;
        }

        if (impl->cfg.base.profile.mono_layout == ESP_LV_ADAPTER_MONO_LAYOUT_VTILED) {
            y1 &= ~7;
            y2 |= 7;
        }

        phy_area.x1 = x1;
        phy_area.y1 = y1;
        phy_area.x2 = x2;
        phy_area.y2 = y2;
        flush_area = &phy_area;
    }

