sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
    const esp_lv_adapter_rotation_t rotation = bridge_rotation(impl);
    const esp_lv_adapter_tear_avoid_mode_t tear_avoid_mode = impl->cfg.base.tear_avoid_mode;
    const bool need_rotate = (rotation != ESP_LV_ADAPTER_ROTATE_0) &&
                             (impl->cfg.base.profile.interface != ESP_LV_ADAPTER_PANEL_IF_OTHER);

    if (need_rotate) {
        switch (tear_avoid_mode) {
        case ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL:
        case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL:
            display_bridge_v9_flush_partial_rotate(impl, disp, flush_area, color_map);
            break;
        case ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL:
        case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL:
            display_bridge_v9_flush_full_rotate(impl, disp, flush_area, color_map);
            break;
        case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT:
            display_bridge_v9_flush_direct_rotate(impl, disp, flush_area, color_map);
            break;
        default:
            ESP_LOGE(TAG, "Unsupported tear mode: %d", tear_avoid_mode);
            display_manager_flush_ready(disp);
            break;
        }
        return;
    }

    switch (tear_avoid_mode) {
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL:
        display_bridge_v9_flush_double_full(impl, disp, flush_area, color_map);
        break;
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL:
        display_bridge_v9_flush_triple_full(impl, disp, flush_area, color_map);
        break;
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT:
        display_bridge_v9_flush_double_direct(impl, disp, flush_area, color_map);
        break;
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL:
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL:
        display_bridge_v9_flush_triple_diff(impl, disp, flush_area, color_map);
        break;
    case ESP_LV_ADAPTER_TEAR_AVOID_MODE_TE_SYNC:
        display_bridge_v9_flush_gpio_te(impl, disp, flush_area, color_map);
        break;
    default:
        display_bridge_v9_flush_default(impl, disp, flush_area, color_map);
        break;
    }
}

/**
 * @brief Set dummy draw mode
 */
static void display_bridge_v9_set_dummy_draw(esp_lv_adapter_display_bridge_t *bridge, bool enable)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    if (!impl) {
        return;
    }

    const bool was_enabled = impl->dummy_draw;
    impl->dummy_draw = enable;
    if (!enable) {
        impl->dummy_draw_wait_task = NULL;
        impl->dummy_draw_wait_mask = 0;

        /* On real disable, align buf_act to the free buffer; skip the setup call. */
        lv_display_t *disp = impl->cfg.lv_disp;
        if (was_enabled && disp &&
                impl->runtime.rotation == ESP_LV_ADAPTER_ROTATE_0 &&
                (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL ||
                 impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL ||
                 impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT)) {
            lv_draw_buf_t *target = NULL;

            if (disp->buf_1 && disp->buf_1->data == impl->draw_fb) {
                target = disp->buf_1;
            } else if (disp->buf_2 && disp->buf_2->data == impl->draw_fb) {
                target = disp->buf_2;
            } else if (disp->buf_1 && disp->buf_1->data == impl->disp_fb && disp->buf_2) {
                disp->buf_2->data = impl->draw_fb;
                target = disp->buf_2;
            } else if (disp->buf_2 && disp->buf_2->data == impl->disp_fb && disp->buf_1) {
                disp->buf_1->data = impl->draw_fb;
                target = disp->buf_1;
            } else if (disp->buf_2) {
                disp->buf_2->data = impl->draw_fb;
                target = disp->buf_2;
            } else if (disp->buf_1) {
                disp->buf_1->data = impl->draw_fb;
                target = disp->buf_1;
            }

            if (target) {
                disp->buf_act = target;
            }
        }
    }
}

/**
 * @brief Update dummy draw callbacks
 */
static void display_bridge_v9_set_dummy_draw_callbacks(esp_lv_adapter_display_bridge_t *bridge,
                                                       const esp_lv_adapter_dummy_draw_callbacks_t *cbs,
                                                       void *user_ctx)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    if (!impl) {
        return;
    }

    if (cbs) {
        impl->cfg.dummy_draw_cbs = *cbs;
        impl->cfg.dummy_draw_user_ctx = user_ctx;
    } else {
        memset(&impl->cfg.dummy_draw_cbs, 0, sizeof(impl->cfg.dummy_draw_cbs));
        impl->cfg.dummy_draw_user_ctx = NULL;
    }
}

static esp_err_t display_bridge_v9_dummy_draw_blit(esp_lv_adapter_display_bridge_t *bridge,
                                                   int x_start,
                                                   int y_start,
                                                   int x_end,
                                                   int y_end,
                                                   const void *frame_buffer,
                                                   bool wait)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    if (!impl || !frame_buffer || !impl->panel) {
        return ESP_ERR_INVALID_ARG;
    }

    if (x_start < 0 || y_start < 0 || x_end <= x_start || y_end <= y_start) {
        return ESP_ERR_INVALID_ARG;
    }

    uint32_t wait_mask = wait ? ESP_LV_ADAPTER_DUMMY_DRAW_EVT_COLOR_DONE : 0;

    if (!impl->dummy_draw) {
        return ESP_ERR_INVALID_STATE;
    }

    if (wait_mask != 0) {
        if (impl->dummy_draw_wait_task) {
            return ESP_ERR_INVALID_STATE;
        }
        impl->dummy_draw_wait_task = xTaskGetCurrentTaskHandle();
        impl->dummy_draw_wait_mask = wait_mask;
    } else {
        impl->dummy_draw_wait_task = NULL;
        impl->dummy_draw_wait_mask = 0;
    }

    esp_err_t ret;
    if (impl->cfg.draw_bitmap_cbs.custom_draw_bitmap) {
        ret = impl->cfg.draw_bitmap_cbs.custom_draw_bitmap(impl->cfg.lv_disp, impl->panel,
                                                           x_start, y_start, x_end, y_end,
                                                           frame_buffer, impl->cfg.draw_bitmap_user_ctx);
    } else {
        ret = display_lcd_blit_area(impl->panel, x_start, y_start, x_end, y_end, frame_buffer);
    }
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Blit area failed: %s", esp_err_to_name(ret));
        impl->dummy_draw_wait_task = NULL;
        impl->dummy_draw_wait_mask = 0;
        return ret;
    }

    if (wait_mask == 0) {
        return ESP_OK;
    }

    uint32_t pending = wait_mask;
    while (pending != 0) {
        uint32_t events = 0;
        (void)xTaskNotifyWait(0, wait_mask, &events, portMAX_DELAY);
        pending &= ~events;
    }

    impl->dummy_draw_wait_task = NULL;
    impl->dummy_draw_wait_mask = 0;
    return ESP_OK;
}

static void *display_bridge_v9_dummy_draw_get_free_buf(esp_lv_adapter_display_bridge_t *bridge)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    if (!impl || !impl->dummy_draw) {
        return NULL;
    }
    if (!bridge_mode_uses_buf_switch_release(impl->cfg.base.tear_avoid_mode)) {
        return NULL;
    }
    return impl->draw_fb;
}

/* Strategy 1: two-buffer DOUBLE_FULL / DOUBLE_DIRECT, wait for the panel switch. */
static esp_err_t display_bridge_v9_dummy_publish_double_wait(esp_lv_adapter_display_bridge_v9_t *impl,
                                                             void *frame_buffer)
{
    esp_err_t ret = display_bridge_v9_submit_double_buffer(impl, frame_buffer);
    if (ret != ESP_OK) {
        return ret;
    }
    void *old_disp = impl->disp_fb;
    impl->disp_fb = frame_buffer;
    impl->draw_fb = old_disp;
    return ESP_OK;
}

/* Strategy 2: TRIPLE_FULL, the ISR publishes pending_fb -> disp_fb on the switch. */
static esp_err_t display_bridge_v9_dummy_publish_triple_pending(esp_lv_adapter_display_bridge_v9_t *impl,
                                                                void *frame_buffer)
{
    TaskHandle_t prev_notify = impl->notify_task;
    impl->notify_task = xTaskGetCurrentTaskHandle();

