sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
    esp_err_t ret = display_bridge_v9_blit_full_frame(impl, frame_buffer, true);
    if (ret != ESP_OK) {
        impl->notify_task = prev_notify;
        return ret;
    }

    portENTER_CRITICAL(&impl->pipeline.lock);
    impl->pending_fb = frame_buffer;
    portEXIT_CRITICAL(&impl->pipeline.lock);

    display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

    struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
    impl->notify_task = prev_notify;

    if (!next) {
        return ESP_ERR_NOT_FOUND;
    }
    impl->draw_fb = next->buffer;
    return ESP_OK;
}

/* Strategy 3: generic pipeline for partial and rotated modes, ISR releases a buffer. */
static esp_err_t display_bridge_v9_dummy_publish_pipeline(esp_lv_adapter_display_bridge_v9_t *impl,
                                                          void *frame_buffer)
{
    TaskHandle_t prev_notify = impl->notify_task;
    impl->notify_task = xTaskGetCurrentTaskHandle();

    esp_err_t ret = display_bridge_v9_blit_full_frame(impl, frame_buffer, true);
    if (ret != ESP_OK) {
        impl->notify_task = prev_notify;
        return ret;
    }

    display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

    struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
    impl->notify_task = prev_notify;

    if (!next) {
        return ESP_ERR_NOT_FOUND;
    }
    impl->disp_fb = frame_buffer;
    impl->draw_fb = next->buffer;
    if (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL ||
            impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL) {
        display_bridge_v9_diff_reset(impl);
    }
    return ESP_OK;
}

static esp_err_t display_bridge_v9_dummy_draw_flush_buf(esp_lv_adapter_display_bridge_t *bridge,
                                                        void *frame_buffer)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    if (!impl || !frame_buffer || !impl->panel || !impl->dummy_draw) {
        return ESP_ERR_INVALID_ARG;
    }

    const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;
    if (!bridge_mode_uses_buf_switch_release(mode)) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (impl->draw_fb != frame_buffer) {
        ESP_LOGW(TAG, "dummy draw fb mismatch (arg=%p, draw_fb=%p)", frame_buffer, impl->draw_fb);
        impl->draw_fb = frame_buffer;
    }

    const bool rotated = bridge_mode_uses_rotated_nonpartial_pipeline_release(impl);
    if (!rotated && bridge_mode_uses_double_switch_wait(mode)) {
        return display_bridge_v9_dummy_publish_double_wait(impl, frame_buffer);
    }
    if (!rotated && mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL) {
        return display_bridge_v9_dummy_publish_triple_pending(impl, frame_buffer);
    }
    return display_bridge_v9_dummy_publish_pipeline(impl, frame_buffer);
}

/**
 * @brief Event callback for area rounding (LVGL v9)
 */
static void rounder_event_cb(lv_event_t *e)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)lv_event_get_user_data(e);
    if (!impl) {
        return;
    }

    lv_area_t *area = lv_event_get_invalidated_area(e);
    if (area) {
        const uint8_t color_bytes = bridge_color_bytes(impl);
        if (impl->cfg.rounder_cb) {
            impl->cfg.rounder_cb(area, impl->cfg.rounder_user_data);
        }
        /* Align area for encrypted external-RAM DMA. Checks source (draw_buf_primary)
         * and dest (draw_fb, stride-aligned only — unaligned stride falls back to CPU copy). */
        if (display_bridge_dma2d_buffer_needs_alignment(impl->cfg.draw_buf_primary) ||
                display_bridge_dma2d_x_rounding_sufficient(impl->draw_fb, bridge_h_res(impl), color_bytes)) {
            int hor_res = impl->cfg.lv_disp ? (int)lv_display_get_horizontal_resolution(impl->cfg.lv_disp) : 0;
            display_bridge_align_area_for_enc_dma(area, hor_res, color_bytes);
        }
    }
}

/**
 * @brief Set area rounding callback
 */
static void display_bridge_v9_set_area_rounder(esp_lv_adapter_display_bridge_t *bridge,
                                               void (*rounder_cb)(lv_area_t *, void *),
                                               void *user_data)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    if (!impl || !impl->cfg.lv_disp) {
        return;
    }

    /* Remove old event callback if exists */
    lv_display_remove_event_cb_with_user_data(impl->cfg.lv_disp, rounder_event_cb, impl);

    impl->cfg.rounder_cb = rounder_cb;
    impl->cfg.rounder_user_data = user_data;

    /* draw_fb: require aligned stride; unaligned stride means rounding won't
     * enable DMA and the flush path already falls back to CPU copy. */
    const bool need_dma2d_rounder =
        display_bridge_dma2d_buffer_needs_alignment(impl->cfg.draw_buf_primary) ||
        display_bridge_dma2d_x_rounding_sufficient(impl->draw_fb,
                                                   bridge_h_res(impl),
                                                   bridge_color_bytes(impl));

    if (rounder_cb || need_dma2d_rounder) {
        lv_display_add_event_cb(impl->cfg.lv_disp, rounder_event_cb, LV_EVENT_INVALIDATE_AREA, impl);
    }
}

static void display_bridge_v9_set_draw_bitmap_callbacks(esp_lv_adapter_display_bridge_t *bridge,
                                                        const esp_lv_adapter_draw_bitmap_callbacks_t *cbs,
                                                        void *user_ctx)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;
    if (!impl) {
        return;
    }

    if (cbs) {
        impl->cfg.draw_bitmap_cbs = *cbs;
        impl->cfg.draw_bitmap_user_ctx = user_ctx;
    } else {
        memset(&impl->cfg.draw_bitmap_cbs, 0, sizeof(impl->cfg.draw_bitmap_cbs));
        impl->cfg.draw_bitmap_user_ctx = NULL;
    }
}

/**********************
 *   DUMMY DRAW EVENTS
 **********************/

