sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
static inline void display_bridge_v9_signal_dummy_draw_event(esp_lv_adapter_display_bridge_v9_t *impl,
                                                             uint32_t event_bit,
                                                             BaseType_t *need_yield)
{
    if (!impl) {
        return;
    }
    if (!(impl->dummy_draw_wait_mask & event_bit)) {
        return;
    }
    TaskHandle_t task = impl->dummy_draw_wait_task;
    if (!task) {
        return;
    }
    xTaskNotifyFromISR(task, event_bit, eSetBits, need_yield);
}

static bool display_bridge_v9_has_pending_submit(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl) {
        return false;
    }

    bool pending = false;
    portENTER_CRITICAL(&impl->pipeline.lock);
    pending = (impl->pending_fb != NULL);
    portEXIT_CRITICAL(&impl->pipeline.lock);
    return pending;
}

static void display_bridge_v9_wait_for_buf_switch(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl) {
        return;
    }

    for (;;) {
        ulTaskNotifyValueClear(NULL, ULONG_MAX);
        if (!display_bridge_v9_has_pending_submit(impl)) {
            break;
        }
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}

/**********************
 *   VSYNC HANDLING
 **********************/

/**
 * @brief VSync event handler (common logic)
 */
static bool IRAM_ATTR display_bridge_v9_handle_vsync(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl) {
        return false;
    }
    BaseType_t need_yield = pdFALSE;

    if (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_NONE) {
        lv_display_t *disp = impl->cfg.lv_disp ? impl->cfg.lv_disp : lv_display_get_default();
        if (disp) {
            display_manager_flush_ready(disp);
        }

        return (need_yield == pdTRUE);
    }

    const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;
    if (!bridge_mode_uses_buf_switch_release(mode)) {
        return (need_yield == pdTRUE);
    }

    if (display_bridge_vsync_on_isr(&impl->vsync_timing)) {
        return pdFALSE;
    }

    return (need_yield == pdTRUE);
}

/*
 * Shared frame-buffer-switch ISR handler. Its only callers are the MIPI DSI and
 * RGB frame-complete callbacks, both compiled out on SoCs that have neither
 * controller; mark it unused so such targets stay warning-clean (the linker
 * garbage-collects it). Keeping it interface-agnostic avoids wrapping pure logic
 * in panel-type macros.
 */
static bool IRAM_ATTR __attribute__((unused))
display_bridge_v9_handle_frame_buf_complete(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;

    display_bridge_v9_signal_dummy_draw_event(impl, ESP_LV_ADAPTER_DUMMY_DRAW_EVT_FRAME_DONE, &need_yield);

    const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;
    if (!bridge_mode_uses_buf_switch_release(mode)) {
        return (need_yield == pdTRUE);
    }

    bool switched = true;
    if (mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL &&
            !bridge_mode_uses_rotated_nonpartial_pipeline_release(impl)) {
        switched = false;
        portENTER_CRITICAL_ISR(&impl->pipeline.lock);
        if (impl->pending_fb) {
            impl->disp_fb = impl->pending_fb;
            impl->pending_fb = NULL;
            switched = true;
        }
        portEXIT_CRITICAL_ISR(&impl->pipeline.lock);
    }

    if (!switched) {
        return false;
    }

    if (!display_bridge_v9_consume_frame_buf_submit_isr(impl)) {
        return false;
    }

    impl->switch_seq++;

    if (bridge_mode_uses_rotated_nonpartial_pipeline_release(impl) ||
            mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL ||
            mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL ||
            mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL) {
        display_bridge_pipeline_release_buf_isr(&impl->pipeline);

        TaskHandle_t notify_task = display_bridge_v9_get_notify_task(impl);
        if (notify_task) {
            vTaskNotifyGiveFromISR(notify_task, &need_yield);
        }
    } else {
        bool double_ready = display_bridge_v9_complete_double_wait_isr(impl);
        if (double_ready && impl->double_wait_sem) {
            xSemaphoreGiveFromISR(impl->double_wait_sem, &need_yield);
        }
    }

    return (need_yield == pdTRUE);
}

static bool IRAM_ATTR display_bridge_v9_handle_color_trans_done(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl || !impl->panel) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;
    display_bridge_v9_signal_dummy_draw_event(impl, ESP_LV_ADAPTER_DUMMY_DRAW_EVT_COLOR_DONE, &need_yield);
    if ((impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_OTHER) && impl->cfg.te_ctx) {
        esp_lv_adapter_te_sync_record_tx_done(impl->cfg.te_ctx);
    }

    bool vsync = false;
    if ((impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_OTHER) ||
            (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_NONE)) {
        vsync = display_bridge_v9_handle_vsync(impl);
    }

    return vsync || (need_yield == pdTRUE);
}

static bool IRAM_ATTR display_bridge_v9_handle_frame_done(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl || !impl->panel) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;
    display_bridge_v9_signal_dummy_draw_event(impl, ESP_LV_ADAPTER_DUMMY_DRAW_EVT_FRAME_DONE, &need_yield);
    bool vsync = display_bridge_v9_handle_vsync(impl);
    return vsync || (need_yield == pdTRUE);
}

static bool IRAM_ATTR display_bridge_v9_notify_color_trans_done_from_isr(esp_lv_adapter_display_bridge_t *bridge)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;

    return display_bridge_v9_handle_color_trans_done(impl);
}

static bool IRAM_ATTR display_bridge_v9_notify_frame_done_from_isr(esp_lv_adapter_display_bridge_t *bridge)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;

    return display_bridge_v9_handle_frame_done(impl);
}

static bool IRAM_ATTR display_bridge_v9_notify_frame_buf_complete_from_isr(esp_lv_adapter_display_bridge_t *bridge)
{
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)bridge;

    return display_bridge_v9_handle_frame_buf_complete(impl);
}

#if CONFIG_SOC_MIPI_DSI_SUPPORTED
static bool IRAM_ATTR display_bridge_v9_on_mipi_color_trans_done(esp_lcd_panel_handle_t panel,
                                                                 esp_lcd_dpi_panel_event_data_t *event_data,
                                                                 void *user_ctx)
{
    (void)panel;
    (void)event_data;
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)user_ctx;

    /* Safety check: panel detached for sleep management */
    if (!impl || !impl->panel) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;
    display_bridge_v9_signal_dummy_draw_event(impl, ESP_LV_ADAPTER_DUMMY_DRAW_EVT_COLOR_DONE, &need_yield);
    bool vsync = false;
    if (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_NONE) {
        vsync = display_bridge_v9_handle_vsync(impl);
    }
    return vsync || (need_yield == pdTRUE);
}

static bool IRAM_ATTR display_bridge_v9_on_mipi_frame_buf_complete(esp_lcd_panel_handle_t panel,
                                                                   esp_lcd_dpi_panel_event_data_t *event_data,
                                                                   void *user_ctx)
{
    (void)panel;
    (void)event_data;
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)user_ctx;

    if (!impl || !impl->panel) {
        return false;
    }

    return display_bridge_v9_handle_frame_buf_complete(impl);
}
#endif /* CONFIG_SOC_MIPI_DSI_SUPPORTED */

