sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
#if CONFIG_SOC_LCD_RGB_SUPPORTED
static bool IRAM_ATTR display_bridge_v9_on_rgb_color_trans_done(esp_lcd_panel_handle_t panel,
                                                                const esp_lcd_rgb_panel_event_data_t *event_data,
                                                                void *user_ctx)
{
    (void)panel;
    (void)event_data;
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)user_ctx;

    /* Safety check: panel detached for sleep management */
    if (!impl || !impl->panel) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;
    display_bridge_v9_signal_dummy_draw_event(impl, ESP_LV_ADAPTER_DUMMY_DRAW_EVT_COLOR_DONE, &need_yield);
    bool vsync = false;
    if (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_NONE) {
        vsync = display_bridge_v9_handle_vsync(impl);
    }
    return vsync || (need_yield == pdTRUE);
}

static bool IRAM_ATTR display_bridge_v9_on_rgb_frame_complete(esp_lcd_panel_handle_t panel,
                                                              const esp_lcd_rgb_panel_event_data_t *event_data,
                                                              void *user_ctx)
{
    (void)panel;
    (void)event_data;
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)user_ctx;

    /* Safety check: panel detached for sleep management */
    if (!impl || !impl->panel) {
        return false;
    }

    bool buf_switch = display_bridge_v9_handle_frame_buf_complete(impl);
    bool vsync = display_bridge_v9_handle_vsync(impl);
    return buf_switch || vsync;
}
#endif

static bool IRAM_ATTR display_bridge_v9_on_io_color_trans_done(esp_lcd_panel_io_handle_t panel_io,
                                                               esp_lcd_panel_io_event_data_t *edata,
                                                               void *user_ctx)
{
    (void)panel_io;
    (void)edata;
    esp_lv_adapter_display_bridge_v9_t *impl = (esp_lv_adapter_display_bridge_v9_t *)user_ctx;

    /* Safety check: panel detached for sleep management */
    if (!impl || !impl->panel) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;
    display_bridge_v9_signal_dummy_draw_event(impl, ESP_LV_ADAPTER_DUMMY_DRAW_EVT_COLOR_DONE, &need_yield);
    if (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TE_SYNC) {
        TaskHandle_t notify_task = display_bridge_v9_get_notify_task(impl);
        if (notify_task) {
            vTaskNotifyGiveFromISR(notify_task, &need_yield);
        }
        return (need_yield == pdTRUE);
    }
    bool vsync = display_bridge_v9_handle_vsync(impl);
    return vsync || (need_yield == pdTRUE);
}

/**
 * @brief Register VSync callbacks based on panel interface type
 */
static void display_bridge_v9_register_vsync(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl || !impl->panel) {
        return;
    }

    if (impl->idf_callbacks_registered || !impl->idf_callback_registration_enabled) {
        return;
    }

    bool registered = false;
    switch (impl->cfg.base.profile.interface) {
    case ESP_LV_ADAPTER_PANEL_IF_MIPI_DSI:
#if CONFIG_SOC_MIPI_DSI_SUPPORTED
    {
        const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;
        esp_lcd_dpi_panel_event_callbacks_t cbs = {
            .on_color_trans_done = display_bridge_v9_on_mipi_color_trans_done,
#ifdef ESP_LCD_DPI_HAS_FRAME_BUF_COMPLETE_CB
            .on_frame_buf_complete = (bridge_mode_uses_buf_switch_release(mode) || impl->dummy_draw) ? display_bridge_v9_on_mipi_frame_buf_complete : NULL,
#else
            .on_refresh_done = (bridge_mode_uses_buf_switch_release(mode) || impl->dummy_draw) ? display_bridge_v9_on_mipi_frame_buf_complete : NULL,
#endif
        };

#ifndef ESP_LCD_DPI_HAS_FRAME_BUF_COMPLETE_CB
        ESP_LOGW(TAG, "on_frame_buf_complete unavailable; buffer-switch release and dummy-draw may not function on MIPI DSI");
#endif
        esp_err_t ret = esp_lcd_dpi_panel_register_event_callbacks(impl->panel, &cbs, impl);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "MIPI DSI callback registration failed (%d)", ret);
        } else {
            registered = true;
        }
        break;
    }
#else
    break;
#endif
    case ESP_LV_ADAPTER_PANEL_IF_RGB:
#if CONFIG_SOC_LCD_RGB_SUPPORTED
    {
        esp_lcd_rgb_panel_event_callbacks_t cbs = {
            .on_color_trans_done = display_bridge_v9_on_rgb_color_trans_done,
            .on_frame_buf_complete = display_bridge_v9_on_rgb_frame_complete,
        };

        esp_err_t ret = esp_lcd_rgb_panel_register_event_callbacks(impl->panel, &cbs, impl);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "register panel callbacks failed (%d)", ret);
        } else {
            registered = true;
        }
        break;
    }
#else
    break;
#endif
    default: {
        esp_lcd_panel_io_handle_t panel_io = impl->cfg.base.panel_io;
        if (!panel_io) {
            ESP_LOGW(TAG, "panel_io handle missing, skip IO callbacks");
            break;
        }

        esp_lcd_panel_io_callbacks_t cbs = {
            .on_color_trans_done = display_bridge_v9_on_io_color_trans_done,
        };
        esp_err_t ret = esp_lcd_panel_io_register_event_callbacks(panel_io, &cbs, impl);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "register panel IO callbacks failed (%d)", ret);
        } else {
            registered = true;
        }
        break;
    }
    }

    impl->idf_callbacks_registered = registered;
}

static void display_bridge_v9_unregister_vsync(esp_lv_adapter_display_bridge_v9_t *impl)
{
    if (!impl) {
        return;
    }

    if (!impl->idf_callbacks_registered) {
        return;
    }

    switch (impl->cfg.base.profile.interface) {
    case ESP_LV_ADAPTER_PANEL_IF_MIPI_DSI:
#if CONFIG_SOC_MIPI_DSI_SUPPORTED
    {
        if (!impl->panel) {
            break;
        }

        const esp_lcd_dpi_panel_event_callbacks_t cbs = {0};
        esp_err_t ret = esp_lcd_dpi_panel_register_event_callbacks(impl->panel, &cbs, NULL);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to clear MIPI DSI callbacks (%d)", ret);
        }
        break;
    }
#else
    break;
#endif
    case ESP_LV_ADAPTER_PANEL_IF_RGB:
#if CONFIG_SOC_LCD_RGB_SUPPORTED
    {
        if (!impl->panel) {
            break;
        }

        const esp_lcd_rgb_panel_event_callbacks_t cbs = {0};
        esp_err_t ret = esp_lcd_rgb_panel_register_event_callbacks(impl->panel, &cbs, NULL);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to clear RGB callbacks (%d)", ret);
        }
        break;
    }
#else
    break;
#endif
    default: {
        esp_lcd_panel_io_handle_t panel_io = impl->cfg.base.panel_io;
        if (!panel_io) {
            break;
        }

        const esp_lcd_panel_io_callbacks_t cbs = {0};
        esp_err_t ret = esp_lcd_panel_io_register_event_callbacks(panel_io, &cbs, NULL);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to clear panel IO callbacks (%d)", ret);
        }
        break;
    }
    }

    impl->idf_callbacks_registered = false;
}

/**********************
 *   FLUSH IMPLEMENTATIONS
 **********************/

/**
 * @brief Remove stride alignment padding from LVGL v9 draw buffer in-place
 *
 * LVGL v9 draw buffers have stride aligned to LV_DRAW_BUF_STRIDE_ALIGN, which
 * may insert padding at the end of each row. LCD panel drivers (SPI/I2C/I80)
 * expect tightly packed pixel data. This function compacts the buffer in-place
 * by removing the per-row padding bytes and returns the resulting row stride
 * in bytes.
 *
 * In PARTIAL mode, LVGL reshapes the draw buffer per flush call, so the stride
 * is based on the flush area width (not the full display width).
 */
static size_t compact_stride_to_packed(uint8_t *buf, const lv_area_t *area,
                                       lv_display_t *disp, uint8_t color_bytes)
{
    size_t src_stride = disp->buf_act->header.stride;
    int rect_w = area->x2 - area->x1 + 1;
    int rect_h = area->y2 - area->y1 + 1;
    size_t row_bytes = (size_t)rect_w * color_bytes;

    if (src_stride <= row_bytes) {
        return src_stride;
    }

    uint8_t *src = buf + src_stride;
    uint8_t *dst = buf + row_bytes;
    for (int y = 1; y < rect_h; y++) {
        memmove(dst, src, row_bytes);
        src += src_stride;
        dst += row_bytes;
    }

