sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
    return row_bytes;
}

/**
 * @brief Default flush (single buffer, no tear protection)
 */
static void display_bridge_v9_flush_default(esp_lv_adapter_display_bridge_v9_t *impl,
                                            lv_display_t *disp,
                                            const lv_area_t *area,
                                            uint8_t *color_map)
{
    esp_lcd_panel_handle_t panel_handle = impl->panel;
    const int offsetx1 = area->x1;
    const int offsetx2 = area->x2;
    const int offsety1 = area->y1;
    const int offsety2 = area->y2;

    compact_stride_to_packed(color_map, area, disp, bridge_color_bytes(impl));

    if (impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_OTHER &&
            lv_display_get_color_format(disp) == LV_COLOR_FORMAT_RGB565) {
        lv_draw_sw_rgb565_swap(color_map, lv_area_get_size(area));
    }

    if (impl->cfg.draw_bitmap_cbs.custom_draw_bitmap) {
        esp_err_t ret = impl->cfg.draw_bitmap_cbs.custom_draw_bitmap(disp, panel_handle,
                                                                     offsetx1, offsety1, offsetx2 + 1, offsety2 + 1,
                                                                     color_map, impl->cfg.draw_bitmap_user_ctx);
        if (ret != ESP_OK) {
            if (ret == ESP_ERR_NOT_ALLOWED) {
                ESP_LOGD(TAG, "Custom draw bitmap not allowed, skipping");
            } else {
                ESP_LOGE(TAG, "Custom draw bitmap failed: %s", esp_err_to_name(ret));
            }
            display_manager_flush_ready(disp);
        }
    } else {
        esp_err_t ret = esp_lcd_panel_draw_bitmap(panel_handle, offsetx1, offsety1, offsetx2 + 1, offsety2 + 1, color_map);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Draw bitmap failed: %s", esp_err_to_name(ret));
            display_manager_flush_ready(disp);
        }
    }
}

/**
 * @brief GPIO TE synchronized flush
 */
static void display_bridge_v9_flush_gpio_te(esp_lv_adapter_display_bridge_v9_t *impl,
                                            lv_display_t *disp,
                                            const lv_area_t *area,
                                            uint8_t *color_map)
{
    esp_lcd_panel_handle_t panel_handle = impl->panel;
    const int offsetx1 = area->x1;
    const int offsetx2 = area->x2;
    const int offsety1 = area->y1;
    const int offsety2 = area->y2;

    compact_stride_to_packed(color_map, area, disp, bridge_color_bytes(impl));

    if (impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_OTHER &&
            lv_display_get_color_format(disp) == LV_COLOR_FORMAT_RGB565) {
        lv_draw_sw_rgb565_swap(color_map, lv_area_get_size(area));
    }

    size_t flush_size = (size_t)lv_area_get_size(area) * bridge_color_bytes(impl);

    /* Notify TE sync to start a new frame */
    if (impl->cfg.te_ctx) {
        esp_lv_adapter_te_sync_begin_frame(impl->cfg.te_ctx, flush_size);
    }

    /* Wait for TE signal to avoid tearing */
    if (impl->cfg.te_ctx) {
        (void)esp_lv_adapter_te_sync_wait_for_vsync(impl->cfg.te_ctx);
    }

    if (impl->cfg.te_ctx) {
        esp_lv_adapter_te_sync_record_tx_start(impl->cfg.te_ctx);
    }

    /* Clear stale completion notifications before kicking off a new transfer. */
    ulTaskNotifyValueClear(NULL, ULONG_MAX);
    esp_err_t ret = esp_lcd_panel_draw_bitmap(panel_handle, offsetx1, offsety1, offsetx2 + 1, offsety2 + 1, color_map);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Draw bitmap failed: %s", esp_err_to_name(ret));
        if (impl->cfg.te_ctx) {
            esp_lv_adapter_te_sync_record_tx_done(impl->cfg.te_ctx);
        }
        display_manager_flush_ready(disp);
        return;
    }

    /* Wait for transmission to complete */
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    if (impl->cfg.te_ctx) {
        esp_lv_adapter_te_sync_record_tx_done(impl->cfg.te_ctx);
    }

    display_manager_flush_ready(disp);
}

/**
 * @brief Double buffering with full-screen refresh
 */
static void display_bridge_v9_flush_double_full(esp_lv_adapter_display_bridge_v9_t *impl,
                                                lv_display_t *disp,
                                                const lv_area_t *area,
                                                uint8_t *color_map)
{
    (void)area;
    esp_err_t ret = display_bridge_v9_submit_double_buffer(impl, color_map);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
        display_manager_flush_ready(disp);
        return;
    }

    display_manager_flush_ready(disp);
}

/**
 * @brief Triple buffering with full-screen refresh
 */
static void display_bridge_v9_flush_triple_full(esp_lv_adapter_display_bridge_v9_t *impl,
                                                lv_display_t *disp,
                                                const lv_area_t *area,
                                                uint8_t *color_map)
{
    (void)area;

    /* DPI has one cur_fb_index: only one pending switch at a time. */
    display_bridge_v9_wait_for_buf_switch(impl);

    esp_err_t ret = display_bridge_v9_blit_full_frame(impl, color_map, false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
    } else {
        /* Old front buffer stays busy until DMA switches to color_map. */
        display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);
        portENTER_CRITICAL(&impl->pipeline.lock);
        impl->pending_fb = color_map;
        portEXIT_CRITICAL(&impl->pipeline.lock);

        struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
        if (!next) {
            display_manager_flush_ready(disp);
            return;
        }
        impl->draw_fb = next->buffer;
        if (disp->buf_act == disp->buf_1) {
            disp->buf_2->data = next->buffer;
        } else {
            disp->buf_1->data = next->buffer;
        }
    }

    display_manager_flush_ready(disp);
}

/**
 * @brief Double buffering with direct mode
 */
static void display_bridge_v9_flush_double_direct(esp_lv_adapter_display_bridge_v9_t *impl,
                                                  lv_display_t *disp,
                                                  const lv_area_t *area,
                                                  uint8_t *color_map)
{
    (void)area;

    /* Action after last area refresh */
    if (lv_display_flush_is_last(disp)) {
        esp_err_t ret = display_bridge_v9_submit_double_buffer(impl, color_map);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
            display_manager_flush_ready(disp);
            return;
        }
    }

    display_manager_flush_ready(disp);
}

/**
 * @brief Triple buffering with partial differential update
 */
static void display_bridge_v9_flush_triple_diff(esp_lv_adapter_display_bridge_v9_t *impl,
                                                lv_display_t *disp,
                                                const lv_area_t *area,
                                                uint8_t *color_map)
{
    const uint8_t color_bytes = bridge_color_bytes(impl);
    const uint16_t lvgl_port_h_res = bridge_h_res(impl);
    const int bytes_per_pixel = color_bytes;
    const int bytes_per_line = lvgl_port_h_res * bytes_per_pixel;
    const int rect_w = area->x2 - area->x1 + 1;
    const int rect_h = area->y2 - area->y1 + 1;
    const int copy_bytes = rect_w * bytes_per_pixel;

