sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
    /*
     * In PARTIAL mode, LVGL reshapes the draw buffer before each flush, so
     * the stride is based on the flush area width, not the full display width.
     */
    const int src_stride = (int)disp->buf_act->header.stride;

#if SOC_DMA2D_SUPPORTED
    uint16_t lvgl_port_v_res = bridge_v_res(impl);

    if (src_stride % bytes_per_pixel == 0 &&
            display_bridge_dma2d_window_is_compatible(color_map,
                                                      src_stride / bytes_per_pixel,
                                                      0,
                                                      rect_w,
                                                      color_bytes) &&
            display_bridge_dma2d_window_is_compatible(impl->draw_fb,
                                                      lvgl_port_h_res,
                                                      area->x1,
                                                      rect_w,
                                                      color_bytes)) {
        size_t src_stride_px = src_stride / bytes_per_pixel;

        display_cache_msync_range(color_map, (size_t)src_stride * rect_h, hw_resource.data_cache_line_size);

#ifdef ESP_ASYNC_COLOR_CONVERT_AVAILABLE
        async_color_convert_request_t blit = {
            .src_buffer  = color_map,
            .dst_buffer  = impl->draw_fb,
            .src_stride  = src_stride_px,
            .src_height  = rect_h,
            .src_x       = 0,
            .src_y       = 0,
            .dst_stride  = lvgl_port_h_res,
            .dst_height  = lvgl_port_v_res,
            .dst_x       = area->x1,
            .dst_y       = area->y1,
            .copy_width  = rect_w,
            .copy_height = rect_h,
            DMA2D_PIXEL_FORMAT_FIELD(color_bytes),
        };
#else
        esp_async_fbcpy_trans_desc_t blit = {
            .src_buffer        = color_map,
            .dst_buffer        = impl->draw_fb,
            .src_buffer_size_x = src_stride_px,
            .src_buffer_size_y = rect_h,
            .src_offset_x      = 0,
            .src_offset_y      = 0,
            .dst_buffer_size_x = lvgl_port_h_res,
            .dst_buffer_size_y = lvgl_port_v_res,
            .dst_offset_x      = area->x1,
            .dst_offset_y      = area->y1,
            .copy_size_x       = rect_w,
            .copy_size_y       = rect_h,
            DMA2D_PIXEL_FORMAT_FIELD(color_bytes),
        };
#endif

        ESP_ERROR_CHECK(display_bridge_dma2d_copy_sync(&blit, portMAX_DELAY));
    } else {
        uint8_t *src = (uint8_t *)color_map;
        uint8_t *dst = (uint8_t *)impl->draw_fb + (area->y1 * lvgl_port_h_res + area->x1) * bytes_per_pixel;

        for (int y = 0; y < rect_h; y++) {
            memcpy(dst, src, copy_bytes);
            dst += bytes_per_line;
            src += src_stride;
        }
    }

#else /* !SOC_DMA2D_SUPPORTED */
    uint8_t *src = (uint8_t *)color_map;
    uint8_t *dst = (uint8_t *)impl->draw_fb + (area->y1 * lvgl_port_h_res + area->x1) * bytes_per_pixel;
    bool is_full_width = (copy_bytes == bytes_per_line);

    if (is_full_width && rect_h > 4 && src_stride == bytes_per_line) {
        memcpy(dst, src, (size_t)rect_h * bytes_per_line);
    } else if (rect_h > 16 && copy_bytes > 64) {
        const int batch_rows = 8;
        int full_batches = rect_h / batch_rows;
        int remaining_rows = rect_h % batch_rows;

        for (int batch = 0; batch < full_batches; batch++) {
            for (int r = 0; r < batch_rows; r++) {
                memcpy(dst, src, copy_bytes);
                dst += bytes_per_line;
                src += src_stride;
            }
        }

        for (int r = 0; r < remaining_rows; r++) {
            memcpy(dst, src, copy_bytes);
            dst += bytes_per_line;
            src += src_stride;
        }
    } else if (copy_bytes == 2 && rect_h <= 8) {
        uint16_t *dst16 = (uint16_t *)dst;
        uint16_t *src16 = (uint16_t *)src;
        const int src_stride_16 = src_stride / (int)sizeof(uint16_t);
        for (int y = 0; y < rect_h; y++) {
            *dst16 = *src16;
            dst16 += lvgl_port_h_res;
            src16 += src_stride_16;
        }
    } else {
        for (int y = 0; y < rect_h; y++) {
            memcpy(dst, src, copy_bytes);
            dst += bytes_per_line;
            src += src_stride;
        }
    }

#endif /* SOC_DMA2D_SUPPORTED */

    if (lv_display_flush_is_last(disp)) {
        lv_display_t *disp_refr = lv_refr_get_disp_refreshing();
        lv_area_t current[DISPLAY_BRIDGE_V9_DIFF_RECT_CAPACITY];
        uint16_t current_count = 0;
        uint8_t target_index = UINT8_MAX;
        bool reset_tracker = false;

        if (!display_bridge_v9_prepare_partial_back_buffer(
                    impl, disp_refr, false, current, &current_count,
                    &target_index, &reset_tracker)) {
            display_manager_flush_ready(disp);
            return;
        }

#if SOC_DMA2D_SUPPORTED
        display_cache_msync_framebuffer(impl->draw_fb, impl->runtime.frame_buffer_size);
        display_cache_msync_invalidate_framebuffer(impl->draw_fb, impl->runtime.frame_buffer_size);
#endif

        esp_err_t ret = display_bridge_v9_blit_full_frame(impl, impl->draw_fb, true);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
        } else {
            display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);
            struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
            if (!next) {
                display_manager_flush_ready(disp);
                return;
            }
            impl->disp_fb = impl->draw_fb;
            impl->draw_fb = next->buffer;
            if (reset_tracker) {
                display_bridge_v9_diff_reset(impl);
            } else {
                display_bridge_v9_diff_commit(
                    impl, target_index, current, current_count);
            }
        }
#if CONFIG_ESP_LVGL_ADAPTER_PARTIAL_AUX_IMG_CACHE
        lv_image_cache_drop(NULL);
#endif
    }

    /* Notify LVGL that flush is complete */
    display_manager_flush_ready(disp);
}

/**
 * @brief Direct mode flush with rotation support (double buffering)
 */
static void display_bridge_v9_flush_direct_rotate(esp_lv_adapter_display_bridge_v9_t *impl,
                                                  lv_display_t *disp,
                                                  const lv_area_t *area,
                                                  uint8_t *color_map)
{
    if (!lv_display_flush_is_last(disp)) {
        display_manager_flush_ready(disp);
        return;
    }

