sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v9/lvgl_bridge_v9.c
        ppa_srm_rotation_angle_t ppa_rotation;
        int x_offset = 0;  /* Physical X offset after rotation */
        int y_offset = 0;  /* Physical Y offset after rotation */

        switch (rotation) {
        case ESP_LV_ADAPTER_ROTATE_90:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_270;
            x_offset = hor_res - 1 - lv_y_end;
            y_offset = lv_x_start;
            break;
        case ESP_LV_ADAPTER_ROTATE_180:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_180;
            x_offset = hor_res - 1 - lv_x_end;
            y_offset = ver_res - 1 - lv_y_end;
            break;
        case ESP_LV_ADAPTER_ROTATE_270:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_90;
            x_offset = lv_y_start;
            y_offset = ver_res - 1 - lv_x_end;
            break;
        default:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_0;
            break;
        }

        /* Configure and start PPA */
        size_t buffer_size = heap_caps_get_allocated_size(dst_fb);
        if (buffer_size == 0) {
            buffer_size = (size_t)color_bytes * hor_res * ver_res;
            size_t line_size = display_bridge_get_cache_line_size_by_addr(dst_fb);
            if (line_size > 0) {
                buffer_size = LVGL_PORT_PPA_ALIGN_UP(buffer_size, line_size);
            }
        }
        ppa_srm_oper_config_t oper_config = {
            .in.buffer          = src,
            .in.pic_w           = src_stride_px,
            .in.pic_h           = rect_h,
            .in.block_w         = block_w_final,
            .in.block_h         = block_h_final,
            .in.block_offset_x  = block_off_x_final,
            .in.block_offset_y  = block_off_y_final,
            .in.srm_cm          = display_bridge_v9_ppa_color_mode(color_bytes),

               .out.buffer         = dst_fb,
               .out.buffer_size    = buffer_size,
               .out.pic_w          = hor_res,
               .out.pic_h          = ver_res,
               .out.block_offset_x = x_offset,
               .out.block_offset_y = y_offset,
               .out.srm_cm         = display_bridge_v9_ppa_color_mode(color_bytes),

               .rotation_angle     = ppa_rotation,
               .scale_x            = PPA_SCALE_FACTOR_NO_SCALE,
               .scale_y            = PPA_SCALE_FACTOR_NO_SCALE,
               .rgb_swap           = PPA_SWAP_DISABLED,
               .byte_swap          = PPA_SWAP_DISABLED,
               .mode               = PPA_TRANS_MODE_BLOCKING,
        };
        ESP_ERROR_CHECK(ppa_do_scale_rotate_mirror(hw_resource.ppa_handle, &oper_config));
        return;
    }
#endif /* CONFIG_SOC_PPA_SUPPORTED */

    /* CPU path with block optimization for better cache locality */
    display_rotate_copy_region(src,
                               dst_fb,
                               lv_x_start,
                               lv_y_start,
                               lv_x_end,
                               lv_y_end,
                               src_stride_px,
                               hor_res,
                               ver_res,
                               rotation,
                               color_bytes,
                               impl->block_size_small,
                               impl->block_size_large);
}

/**
 * @brief Rotate and copy full region (uses PPA if available)
 */
static void IRAM_ATTR rotate_copy_region(esp_lv_adapter_display_bridge_v9_t *impl,
                                         const void *from, void *to,
                                         uint16_t x_start, uint16_t y_start,
                                         uint16_t x_end, uint16_t y_end,
                                         uint16_t src_logical_w, uint16_t src_logical_h,
                                         uint16_t dst_physical_w, uint16_t dst_physical_h,
                                         esp_lv_adapter_rotation_t rotation,
                                         uint8_t color_bytes)
{
#if CONFIG_SOC_PPA_SUPPORTED
    if (hw_resource.ppa_handle && (color_bytes == 2 || color_bytes == 3)) {
        ppa_srm_rotation_angle_t ppa_rotation;
        int x_offset = 0, y_offset = 0;
        const uint16_t rect_w = x_end - x_start + 1;
        const uint16_t rect_h = y_end - y_start + 1;

        /* Determine rotation settings once and reuse */
        switch (rotation) {
        case ESP_LV_ADAPTER_ROTATE_90:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_270;
            x_offset = dst_physical_w - y_end - 1;
            y_offset = x_start;
            break;
        case ESP_LV_ADAPTER_ROTATE_180:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_180;
            x_offset = dst_physical_w - x_end - 1;
            y_offset = dst_physical_h - y_end - 1;
            break;
        case ESP_LV_ADAPTER_ROTATE_270:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_90;
            x_offset = y_start;
            y_offset = dst_physical_h - x_end - 1;
            break;
        default:
            ppa_rotation = PPA_SRM_ROTATION_ANGLE_0;
            x_offset = x_start;
            y_offset = y_start;
            break;
        }

        /* Fill operation config for PPA rotation, without recalculating each time */
        size_t buffer_size = heap_caps_get_allocated_size(to);
        if (buffer_size == 0) {
            buffer_size = (size_t)color_bytes * dst_physical_w * dst_physical_h;
            size_t line_size = display_bridge_get_cache_line_size_by_addr(to);
            if (line_size > 0) {
                buffer_size = LVGL_PORT_PPA_ALIGN_UP(buffer_size, line_size);
            }
        }
        ppa_srm_oper_config_t oper_config = {
            .in.buffer = from,
            .in.pic_w = src_logical_w,
            .in.pic_h = src_logical_h,
            .in.block_w = rect_w,
            .in.block_h = rect_h,
            .in.block_offset_x = x_start,
            .in.block_offset_y = y_start,
            .in.srm_cm = display_bridge_v9_ppa_color_mode(color_bytes),

               .out.buffer = to,
               .out.buffer_size = buffer_size,
               .out.pic_w = dst_physical_w,
               .out.pic_h = dst_physical_h,
               .out.block_offset_x = x_offset,
               .out.block_offset_y = y_offset,
               .out.srm_cm = display_bridge_v9_ppa_color_mode(color_bytes),

